function biggestElement(input){
    let sortedArray = [];
    
for (let i = 0; i < input.length; i++) { // минаваме през различните масиви в основния масив и за всеки правим следното:
    input[i].sort((a,b) => b - a); // сортираме числата във всеки отделен масив (от голямо към малко исло)
    sortedArray.push(input[i][0]); // пушваме в новия масив само най-голямото число (което се пада на първа позиция в дадения масив)
}
sortedArray.sort((a,b) => b - a); // подреждаме/сортираме числата в новия масив от голямо към малко
console.log(sortedArray[0]); // и принтираме числото, което е на 0 позиция - то се явява най-голямо за вси1ки масиви в главния масив
}

biggestElement(
    [[20, 50, 10],
    [8, 33, 145]]);

biggestElement(
    [[3, 5, 7, 12],
    [-1, 4, 33, 2],
    [8, 3, 0, 4]])