решена от преподавател в SoftUni

function solve(input) {
    const n = Number(input[0]); // в променливата n - запазваме първата стойност от подадения масив с входни данни.
    const firstSum = Number(input[1]) + Number(input[2]); // Откриваме първата сума , като използваме индексацията на масивите и при изчислението пропускаме елемента на 1-ва позиция ( индекс 0 )
    let currentSum = 0;
    let difference = 0;
    let maxDiff = 0;
    let isEqual = false;
  //Инизиализираме нужните променливи, които ще използваме за да решим задачата.
   
   
    if (n === 1) { // правим проверка, ако подаденото число е 1 - отпечатваме крайния резултат и програмата приключва своето изпълнение.
      console.log(`Yes, value=${firstSum}`);
    } else { // ако числото не е равно на 1 - влизаме в else.
      for (let i = 3; i <= 2 * n; i += 2) { // тук правим for цикъл , като започваме от индекс 3, защо искаме да пропуснем числото на индекс 0 - него сме го запазили в променлива n, както и сме направили сумиране на второто и третото число ( индекс 1 и индекс 2 )
        currentSum = +input[i] + +input[i + 1]; // изчисляваме текущата сума, като влизаме числото на текущия индекс + числото на следващия индекс ( i + 1 ). +input[i] + +input[i + 1] e еквивалентно на Number(input[i]) + Number(input[i+1])
        if (firstSum === currentSum) { // правим проверка дали сумите са равни и ако това условие е изпълнено,на променливата isEqual присвояваме нова стойност - true. 
          isEqual = true;
        } else { // в противен случай, правим изчисление за да намерим разликата. Като достъпваме елементите на предната и по-предната позиция и ги сумираме. Тази сума я изваждаме от текущата сума , която се намира в променливата currentSum и използваме Math.abs - ако случайно се получи отрицателна сума.
          difference = Math.abs(+input[i - 2] + +input[i - 1] - currentSum);
        }
        if (difference >= maxDiff) { // След като сме изчислили difference , правим проверка дали тази разлика е по-голяма от максималната разлика от всички сравнения. Ако е по-голяма, в променливата maxDiff присвояваме нова стойност за да имаме винаги най-голямата разлика в тази променлива.
          maxDiff = difference;
        }
      }
  //След тялото на цикъла трябва да направим проверка дали isEqual е true или false и на базата на тази стойност, ще отпечатаме нужното съобщение.
      if (isEqual === false) {
        console.log(`No, maxdiff=${maxDiff}`);
      } else {
        console.log(`Yes, value=${firstSum}`);
      }
    }
  }
solve(["3","1","2","0","3","4","-1"]);